#+ORG2BLOG:
#+BLOG: wisdomandwonder
#+POSTID: 10678
#+DATE: [2017-08-18 Fri 18:13]
#+OPTIONS: toc:nil num:nil todo:nil pri:nil tags:nil ^:nil
#+CATEGORY: Article
#+TAGS: Programming Language, Go Lang, GBEN
#+TITLE: (Go Lang) Recursion (GBEN)

[[https://gobyexample.com/recursion][Go by Example]]
* Example
- It has it
#+HTML: <!--more-->
#+NAME: org_gcr_2017-08-18_mara_900BEAAF-59EE-4365-B326-7975EED5AB3D
#+BEGIN_SRC go :results output
package main

import "fmt"

// This fact function calls itself until it reaches the base case of fact(0).
func fact(n int) int {
  if n == 0 {
    return 1
  }
  return n * fact(n-1)
}

func main() {
  fmt.Println(fact(7))
}
#+END_SRC

#+RESULTS: org_gcr_2017-08-18_mara_900BEAAF-59EE-4365-B326-7975EED5AB3D
#+BEGIN_EXAMPLE
5040
#+END_EXAMPLE

[[https://www.wisdomandwonder.com/article/10651/go-lang-go-by-example-notes-gben][Attribution]]
